# --------------------------- Homework_8  ------------------------------------

r'''

Виконав: Роман Стебельський
Homework_8

    Реалізовано:
        1.
            Клас game_image реалізовано з використанням декораторів.
            У попередніх завданнях публічний метод transform_image обгортав приватні методи - "інструменти",
            (їх перелік описаний нижче). У поточному ДЗ метод transform_image перетворено на статичний
            і він є декоратором для вже публічних методів - "інструментів".
                 Методи - "інструменти":
                __turn_left - повертає зображення проти годинникової стрілки
                __turn_right - повертає зображення за годинниковою стрілкою
                __mirror_vertical - віддзеркалює зображення по вертикалі
                __mirror_horizon - віддзеркалює зображення по горизонталі
                __reduce - вдвічі зменшує зображення

        2.
            Для функції get_data(), яка повертає список днів тижня
            Створіть два декоратора:

            Декоратор_№1 / Обов'язковий/ short_form -> повертає скорочення днів тижня
            приклад:
            Коли get_data() має значення ['Monday', ..., 'Sunday'], тоді декоратор
            short_form має повертати ['Mon', ..., 'Sun'].
            *** Порада: знайдіть модуль `calendar` та функцію, яка підходить саме Вам.

            Декоратор_№2 / Додатковий / translate(language) -> декоратор, який приймає аргумент «language».
            Має перекласти назви днів тижня на мову, вказану в параметрі.
            *** Порада: дізнайтеся, як працює модуль `locale`, і знайдіть функцію `setlocale`.
            Ви можете вільно використовувати будь-яке інше рішення перекладу

            В результаті програма повинна просто вивести на екран список, наприклад, німецькомовних скорочень днів тижня. ->
            ['Mo', 'Di', 'Mi', 'Do', 'Fr', 'Sa', 'So']

            Декоратори та головні виклики мають бути в різних модулях!
            Бажано передбачити ствоерення та використання віртуального оточення.

Package            Version
------------------ -----------
pandas             2.2.3
pillow             11.2.1
pip                23.2.1
matplotlib         3.10.1
numpy              2.2.4
Locales            0.0.2

'''

from game_image2 import game_image2 as gi2
import my_calendar as mc


# ---------------------------------- головні виклики --------------------------------
if __name__ == "__main__":

    print('--------------------------- Трансформація зображення ---------------------------')

    file_fiona = "fiona.jpg"
    file_fiona_save = "fiona_save.jpg"
    fiona = gi2(file_fiona, file_fiona_save)
    fiona.reduce()
    fiona.reduce()
    fiona.game_interface()
    del fiona

    print('--------------------------- Календар ---------------------------')

    print('поточна локалізація')
    print(mc.my_locale)
    print('цільова локалізація')
    print(mc.new_locale['new_locale'])

    print('виконуємо дії з календарем')
    print('перелік днів до виконання функції', list(mc.calendar.day_abbr))
    print('------------')
    mc.get_data(finish=5)
    mc.get_data(start=5)
    mc.new_locale['new_locale'] = 'it_IT.UTF-8'
    mc.get_data(start=2, finish=5)
    mc.get_data()
    print('------------')
    print('перелік днів після виконання функції', list(mc.calendar.day_abbr))


r'''    

Результат:

--------------------------- Трансформація зображення ---------------------------

        1. завантажити оригінал
        2. повернути за годинниковою стрілкою
        3. повернути проти годинникової стрілки
        4. дзеркальне відображення по горизонталі
        5. дзеркальне відображення по вертикалі
        6. зменшити 
        7. зберегти
        8. завершити без збереження
    
Вкажіть номер однієї з доступних команд:2
Вкажіть номер однієї з доступних команд:7
зображення збережено
ви працювали з файлом - fiona.jpg
--------------------------- Календар ---------------------------
поточна локалізація
('Ukrainian_Ukraine', '1251')
цільова локалізація
de_DE.utf8
виконуємо дії з календарем
перелік днів до виконання функції ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Нд']
------------
перелік днів з функції ['Mo', 'Di', 'Mi', 'Do', 'Fr']
перелік днів з функції ['Sa', 'So']
перелік днів з функції ['mer', 'gio', 'ven']
перелік днів з функції ['lun', 'mar', 'mer', 'gio', 'ven', 'sab', 'dom']
------------
перелік днів після виконання функції ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Нд']

Process finished with exit code 0

'''