# --------------------------- Homework_4  ------------------------------------

'''

Виконав: Роман Стебельський
Homework_4, ІI рівень складності:

Реалізовано:
    1. Набір функцій котрі модифікують зображення - "інструменти модифікації зображення"
    2. Функція game_with_image надає інтерфейс для роботи з "інструментами модифікації зображення".
    3. Виконано анотацію та документацію функцій
    4. Частина функцій винесена в окремі файли.

Package                      Version
---------------------------- -----------
Pillow                       11.2.1
matplotlib                   3.10.1
numpy                        2.2.4

'''

import interface as inf

# ---------------------------------- головні виклики --------------------------------
if __name__ == "__main__":

    # переглядаємо документацію функції
    print(inf.game_with_image.__annotations__)
    print('-------------------------------------')
    help(inf.game_with_image)
    print('-------------------------------------')

    # демонстрація роботи функції
    file_name_raw = "start.jpg"
    file_name_result = "stop.jpg"
    inf.game_with_image (file_name_raw, file_name_result)

'''
Резюме:
    У файлі interface маємо не підсвічений імпорт "from tools ...". 
    З однієї сторони втрачаємо явність з іншої оптимізація коду.

Результат:

    {'file_name_raw': <class 'str'>, 'file_name_result': <class 'str'>, 'return': None}
    -------------------------------------
    Help on function game_with_image in module interface:
    
    game_with_image(file_name_raw: str, file_name_result: str) -> None
        Інтерфейс для завантаження/модифікації/збереження файлу з зображенням
    
        Функція завантажує файл з зображенням. Виводить інтерфейс в якому є можливість
        обрати команду(и):
            - модифікації зображення
            - збереження файлу з зображенням
            - відміна модифікації зображення шляхом повторного завантаження оригіналу
            - завершення обробки файлу без збереження
    
        :param file_name_raw: назва файлу з зображенням котре потрібно модифікувати.
        :param file_name_result: назва файлу в якому буде збережено модифіковане зображення.
        :return: не повертає жодного значення
        :exception FileNotFoundError: якщо файл не знайдено.
        :exception ValueError: якщо введено значення номера команди не є числом.
    
    -------------------------------------

        1. завантажити оригінал
        2. повернути за годинниковою стрілкою
        3. повернути проти годинникової стрілки
        4. дзеркальне відображення по горизонталі
        5. дзеркальне відображення по вертикалі
        6. зменшити 
        7. зберегти
        8. завершити без збереження
    
Вкажіть номер однієї з доступних команд:2
Вкажіть номер однієї з доступних команд:6
Вкажіть номер однієї з доступних команд:6
Вкажіть номер однієї з доступних команд:6
Вкажіть номер однієї з доступних команд:7
зображення збережено

Process finished with exit code 0

'''






