# --------------------------- Homework_7  ------------------------------------

r'''

Виконав: Роман Стебельський
Homework_7, створення оточення на основі коду з ДЗ 6

    Реалізовано:
        створено файл з переліком бібліотек (містить пакети які використовувались у проекті) - pip freeze >> requirements.txt
        створив віртуальне середовище - python -m venv .venv
        активізував його - .\.venv\Scripts\activate
        інсталював пакети - pip install -r requirements.txt

Package            Version
------------------ -----------
pandas             2.2.3
pillow             11.2.1
pip                23.2.1
matplotlib         3.10.1
numpy              2.2.4
pydantic           2.11.3

'''

from game_image import game_image as gi
from game_image2 import game_image2 as gi2
from library import library as lib

# ---------------------------------- головні виклики --------------------------------
if __name__ == "__main__":

    print('--------------------------- бібліотека ---------------------------')
    new_book = {
        'author': 'Т. Шевченко',
        'title': 'Кобзар',
        'publisher': 'Сонечко',
        'genre': 'поезія',
        'year_publication': 1840
    }
    # книгу Кобзар додано до бібліотеки
    my_lib = lib(1, new_book)

    print('----- додавання книг у бібліотеку + валідація -----')
    new_book = {
        'author': 'Л. Українка',
        'title': 'Лісова пісня',
        'publisher': 'Сонечко',
        'genre': 'драма-феєрія',
        'year_publication': '1912р.'
    }
    # книга під номером 1 вже існує
    my_lib[1] = new_book
    # невірний тип даних атрибуту year_publication
    my_lib[2] = new_book
    # виправляємо тип даних атрибуту
    new_book['year_publication'] = 1912
    # невірний тип даних номеру книги
    my_lib['#2'] = new_book
    # правильний тип даних номеру книги
    my_lib[2] = new_book

    new_book = {
        'author': 'Л. Українка',
        'title': 'На крилах пісень',
        'publisher': 'Сонечко',
        'genre': 'поезія',
        'year_publication': 1893
    }
    my_lib[3] = new_book


    print('----- доступу до книги за номером -----')
    # книги з вказаним номером не знайдено
    print(my_lib[4])
    print('знайдено книгу за номером 2', my_lib[2])

    print('----- пошук по книгах -----')
    print("author = 'Л. Українка'                  :", my_lib(author = 'Л. Українка'))
    print("author = 'Л. Українка', genre = 'поезія':", my_lib(author = 'Л. Українка', genre = 'поезія'))
    print("genre = 'поезія'                        :", my_lib(genre = 'поезія'))

    print('----- видалення книги  -----')
    del my_lib[3]

    print('----- демонстрація всіх сформованих елементів класу -----')
    for key in my_lib:
        print(key, '-', my_lib[key])

    del my_lib

    print('--------------------------- Трансформація зображення ---------------------------')

    print('екземпляр зі Шреком')
    file_shrek = "shrek.jpg"
    shrek = gi(file_shrek)

    print('екземпляр з Фіоною')
    file_fiona = "fiona.jpg"
    fiona = gi(file_fiona)

    fiona.transform_image(gi.get_tool(2))
    fiona.show_image()

    shrek.transform_image(gi.get_tool(6))
    shrek.transform_image(gi.get_tool(6))
    shrek.transform_image(gi.get_tool(6))
    shrek.transform_image(gi.get_tool(6))
    shrek.show_image()

    print('деструктор при видалені екземпляру з Фіоною')
    del fiona

    print('-------------------------------------')

    print('екземпляр з Фіоною приклад з класом game_image2')
    file_fiona = "fiona.jpg"
    file_fiona_save = "fiona_save.jpg"
    fiona = gi2(file_fiona, file_fiona_save)
    fiona.game_interface()

    print('продовжуємо працювати з екземпляр з Фіоною')
    fiona.transform_image(gi.get_tool(6))
    fiona.transform_image(gi.get_tool(6))
    fiona.file_name_result = 'fiona_save_2.jpg'
    fiona.save_img()

    print('Скрипт завершує роботу, зараз відпрацюють деструктори fiona & shrek')



r'''    

Результат:

--------------------------- бібліотека ---------------------------
книгу "Кобзар" додано до бібліотеки
----- додавання книг у бібліотеку + валідація -----
книга під номером 1 вже існує
дані про книгу неповні або некоректні
дані про книгу неповні або некоректні
книгу "Лісова пісня" додано до бібліотеки
книгу "На крилах пісень" додано до бібліотеки
----- доступу до книги за номером -----
книги з вказаним номером не знайдено
None
знайдено книгу за номером 2 {'author': 'Л. Українка', 'title': 'Лісова пісня', 'publisher': 'Сонечко', 'genre': 'драма-феєрія', 'year_publication': 1912}
----- пошук по книгах -----
author = 'Л. Українка'                  : {2: {'author': 'Л. Українка', 'title': 'Лісова пісня', 'publisher': 'Сонечко', 'genre': 'драма-феєрія', 'year_publication': 1912}, 3: {'author': 'Л. Українка', 'title': 'На крилах пісень', 'publisher': 'Сонечко', 'genre': 'поезія', 'year_publication': 1893}}
author = 'Л. Українка', genre = 'поезія': {3: {'author': 'Л. Українка', 'title': 'На крилах пісень', 'publisher': 'Сонечко', 'genre': 'поезія', 'year_publication': 1893}}
genre = 'поезія'                        : {1: {'author': 'Т. Шевченко', 'title': 'Кобзар', 'publisher': 'Сонечко', 'genre': 'поезія', 'year_publication': 1840}, 3: {'author': 'Л. Українка', 'title': 'На крилах пісень', 'publisher': 'Сонечко', 'genre': 'поезія', 'year_publication': 1893}}
----- видалення книги  -----
книгу під номером - 3 видалено
----- демонстрація всіх сформованих елементів класу -----
1 - {'author': 'Т. Шевченко', 'title': 'Кобзар', 'publisher': 'Сонечко', 'genre': 'поезія', 'year_publication': 1840}
2 - {'author': 'Л. Українка', 'title': 'Лісова пісня', 'publisher': 'Сонечко', 'genre': 'драма-феєрія', 'year_publication': 1912}
бібліотека зачиняється.
--------------------------- Трансформація зображення ---------------------------
екземпляр зі Шреком
екземпляр з Фіоною
деструктор при видалені екземпляру з Фіоною
дякуємо що скористались нашим додатком.
-------------------------------------
екземпляр з Фіоною приклад з класом game_image2

        1. завантажити оригінал
        2. повернути за годинниковою стрілкою
        3. повернути проти годинникової стрілки
        4. дзеркальне відображення по горизонталі
        5. дзеркальне відображення по вертикалі
        6. зменшити 
        7. зберегти
        8. завершити без збереження
    
Вкажіть номер однієї з доступних команд:2
Вкажіть номер однієї з доступних команд:7
зображення збережено
продовжуємо працювати з екземпляр з Фіоною
Скрипт завершує роботу, зараз відпрацюють деструктори fiona & shrek
дякуємо що скористались нашим додатком.
ви працювали з файлом - fiona.jpg

Process finished with exit code 0

'''