# --------------------------- Homework_6_2  ------------------------------------

'''

Виконав: Роман Стебельський
Homework_6_2, ІI рівень складності:

    Реалізовано:
       Застосовано принцип - Принцип підстановки Барбари Лісков
       У попередньову ДЗ конструктор класу game_image мап один параметр (назву файлу котрий потрібно відкрити),
       а конструктор класу game_image2 отримав вже два параметри, додався параметр назви файлу для збереження.
       Виправлено, тепер game_image2 - приймає один параметр, аналогічно класу game_image.
       Назву файлу для збереження почав приймати метод збереження зображення у файл.


Package            Version
------------------ -----------
pandas             2.2.3
pillow             11.2.1
pip                23.2.1
matplotlib         3.10.1
numpy              2.2.4

'''

from game_image2 import game_image2 as gi2

# ---------------------------------- головні виклики --------------------------------
if __name__ == "__main__":



    print('--------------------------- Трансформація зображення ---------------------------')

    print('екземпляр з Фіоною приклад з класом game_image2')
    file_fiona = "fiona.jpg"
    fiona = gi2(file_fiona)
    fiona.game_interface()

    print('продовжуємо працювати з екземпляр з Фіоною')
    fiona.transform_image(gi2.get_tool(6))
    fiona.transform_image(gi2.get_tool(6))
    fiona.transform_image(gi2.get_tool(6))
    fiona.transform_image(gi2.get_tool(6))
    fiona.save_img('fiona_save_2.jpg')



r'''    

Результат:

--------------------------- Трансформація зображення ---------------------------
екземпляр з Фіоною приклад з класом game_image2

        1. завантажити оригінал
        2. повернути за годинниковою стрілкою
        3. повернути проти годинникової стрілки
        4. дзеркальне відображення по горизонталі
        5. дзеркальне відображення по вертикалі
        6. зменшити 
        7. зберегти
        8. завершити без збереження
    
Вкажіть номер однієї з доступних команд:2
Вкажіть номер однієї з доступних команд:7
Введіть назву файлу:fiona_save_2.jpg
зображення збережено
продовжуємо працювати з екземпляр з Фіоною
Скрипт завершує роботу, зараз відпрацюють деструктори fiona & shrek
ви працювали з файлом - fiona.jpg

Process finished with exit code 0
'''