# --------------------------- Homework_2  ------------------------------------

'''

Виконав: Роман Стебельський
Homework_2, ІI рівень складності:

Розробити python програмний скрипт, який реалізує перелік технічних вимог І, ІІ.
Група вимог І
    Реалізувати програмно логіку роботи алгоритму FizzBuzz.
    На вхід алгоритму подається деяке число n – набране із клавіатури, або задане
    множиною. Необхідно сформувати вихідну послідовність, що відповідає властивостям
    числа n:
    якщо число можна поділити на 3 без залишку, замість числа буде виведено Fizz.
    якщо число ділиться на 5 без залишку, результат відображатиме Buzz замість числа.
    якщо дане число ділиться і на 3, і на 5, замість числа буде надруковано FizzBuzz.
    якщо число не можна поділити на 3 або 5, воно буде надруковано в оригіналі.

Група вимог ІІ
    Здійснити програмний розрахунок площі пласких (2D) фігур за власним вибором,
    параметри фігури вводити із клавіатури. Результат привести до обраного простого типу з
    переліку: numeric (int, float), str.
    Передбачити коректну роботу програми із впровадженням технологій обробки
    виключень з директивами try / except / else / finally
        Алгоритм реалізує:
            1. визначення переліку фігур та їх атрибутів. Кожна фігура має наступні атрибути:
                name - назва
                result_caption - підпис який передує значенню площі при виведенні результату
                input - перелік параметрів для вводу. ключ - назва змінної параметру, значення - підпис повідомлення при зборі даних
            2. вибір однієї з фігур (коло, прямокутник, трапеція)
            3. визначення переліку вхідних параметрів відповідно до обраної фігури
            4. введення вхідних параметрів
            5. визначення алгоритму розрахунку площі відповідно до обраної фігури
            6. розрахунок площі фігури
            7. виведення результату

    Група вимог ІІI
    Розробити блок-схему алгоритму для реалізації технічних вимог груп І в середовищі https://www.diagrams.net/

Package                      Version
---------------------------- -----------
pip                          23.2.1

'''

# --------------------------------- група вимог І ----------------------------------------------
try:
    my_number = int(input("Введіть ціле число:"))
except ValueError:
    print('Введено некоректне значення, введіть ціле число')
else:
    numbers = list(range(1, my_number + 1))
    for index, value in enumerate(numbers):
        result_check = '' if value % 3 else 'Fizz'
        result_check += '' if value % 5 else 'Buzz'
        numbers[index] = result_check if result_check else numbers[index]

    print('Результат обробки: ', numbers)

# --------------------------------- група вимог ІI ----------------------------------------------
# 1. визначення переліку фігур та їх атрибутів
figures = {
    1: {
        'name': 'коло',
        'result_caption': 'площа кола',
        'input': {
            'r': 'радіус кола - '
        }
    },
    2: {
        'name': 'прямокутник',
        'result_caption': 'площа прямокутника',
        'input': {
            'a': 'довжину прямокутника - ',
            'b': 'ширину прямокутника - '}
        },
    3: {
        'name': 'трапеція',
        'result_caption': 'площа трапеції',
        'input': {
            'a': 'першу основу трапеції - ',
            'b': 'другу основу трапеції - ',
            'h': 'висоту трапеції - '
        }
    }
}
msg_result       = ''
s_figure         = 0
selected_figure  = 0
output_parameter = dict()

try:
    # 2. вибір однієї з фігур (коло, прямокутник, трапеція)
    print('Вкажіть номер фігури площу котрої необхідно розрахувати:')
    for key in figures:
        print(key, '). ', figures[key]['name'], sep='')

    selected_figure = int(input('номер фігури - '))

    # 3. визначення переліку вхідних параметрів відповідно до обраної фігури
    input_parameter =  figures[selected_figure]['input']
except ValueError:
    msg_result = 'Визначити фігуру не вдалось. Вкажіть ціле число від 1 до ' + str(len(figures))
except KeyError:
    msg_result = 'Фігура за введеним числом не закріплена. Вкажіть число від 1 до ' + str(len(figures))
else:

    try:
        # 4. введення вхідних параметрів відповідно до обраної фігури
        print('ви обрали фігуру -', figures[selected_figure]['name'])
        print('вкажіть параметр(и) фігури')
        for key in input_parameter:
            output_parameter[key] = float(input(input_parameter[key]))

    except ValueError:
        msg_result = 'один або декілька параметрів фігури не відповідають вимогам. введіть число'
    else:
        # 5. визначення алгоритму розрахунку площі відповідно до обраної фігури
        match selected_figure:
            case 1:
                # 6.1 розрахунок площі кола
                r = output_parameter['r']
                s_figure = 3.14 * r * r
            case 2:
                # 6.2 розрахунок площі прямокутника
                a, b = output_parameter.values()
                s_figure = a * b
            case 3:
                # 6.3 розрахунок площі трапеції
                a, b, h = output_parameter.values()
                s_figure = (a + b) * 0.5 * h
            case _:
                pass

        msg_result = figures[selected_figure]['result_caption'] + ' - ' + str(s_figure)
finally:
    # 7. виведення результату
    print(msg_result)


'''
Результат:
група вимог І

Введіть ціле число:25
Результат обробки:  [1, 2, 'Fizz', 4, 'Buzz', 'Fizz', 7, 8, 'Fizz', 'Buzz', 11, 'Fizz', 13, 14, 'FizzBuzz', 16, 17, 'Fizz', 19, 'Buzz', 'Fizz', 22, 23, 'Fizz', 'Buzz']

група вимог ІI

Вкажіть номер фігури площу котрої необхідно розрахувати:
1). коло
2). прямокутник
3). трапеція
номер фігури - 3
ви обрали фігуру - трапеція
вкажіть параметр(и) фігури
першу основу трапеції - 2
другу основу трапеції - 3.6
висоту трапеції - 9.4
площа трапеції - 26.32

Резюме - якщо є бажання поділитись думками:
1) Рішення задачі про розрахунок площі фігури було реалізовано з try ще в першому ДЗ. 
В варіанті рішення для другого ДЗ були додатково задіяно два блоки (else та finally). Це дозволило відмовитись від зайвої умови if len(msg_result) == 0:

2) Є питання стосовно відображення на блок схемах функцій та крнструкції try
    - В блоці який відображає функцію потрібно прописати тільки назву функції, чи весь алгорим який виконує ця функція?
    - на відміну від блок схем з першого ДЗ я по іншому відобразив крнструкцію try. 
    Тобто спочатку йде блок з кодом який описаний в try, потім умова виключення і дві гілки якщо є виключення і якщо виключення відсутнє.

'''
